; domain
(define (domain blocky-game)
    (:requirements :strips :typing :derived-predicates)
    (:types
        place - object ; names of places should conform to pattern placeXY, where X and Y have the same number of digits
        room - object
        person - object
        thing - object
        takeable - thing
        key - takeable
        terminal - thing
        exit - thing
        entrance - object
        direction - object
        colour - object)
    (:constants
        up down left right - direction)
    (:predicates
        (at ?room - room
            ?place - place)
        (in ?person - person
            ?room - room)
        (contains ?room - room
            ?thing - thing)
        (adjacent ?place1 - place
            ?place2 - place
            ?direction - direction)
        (passage ?room - room
            ?entrance - entrance
            ?direction - direction)
        (has_door ?entrance - entrance
            ?colour - colour)
        (owned ?thing - takeable
            ?person - person)
        (is ?key - key
            ?colour - colour)
        (reversed ?direction - direction
            ?reverse_direction - direction)
        (free ?place - place)
        (escaped ?person - person))
    ; poor support, should be defined in each problem instance
    ; (:timeless
    ;     (reversed up down)
    ;     (reversed down up)
    ;     (reversed left right)
    ;     (reversed right left))
    (:action go
        :parameters (
            ?person - person
            ?room1 - room
            ?room2 - room
            ?place1 - place
            ?place2 - place
            ?entrance1 - entrance
            ?entrance2 - entrance
            ?direction - direction
            ?reverse_direction - direction
            ?colour - colour
            ?key - key)
        :precondition (and
            (adjacent ?place1 ?place2 ?direction)
            (at ?room1 ?place1)
            (at ?room2 ?place2)
            (passage ?room1 ?entrance1 ?direction)
            (passage ?room2 ?entrance2 ?reverse_direction)
            (has_door ?entrance1 ?colour)
            (has_door ?entrance2 ?colour)
            (in ?person ?room1)
            (owned ?key ?person)
            (is ?key ?colour))
        :effect (and
            (not (in ?person ?room1))
            (in ?person ?room2)))
    (:action take
        :parameters (
            ?person - person
            ?thing - takeable
            ?room - room)
        :precondition (and
            (contains ?room ?thing)
            (in ?person ?room))
        :effect (and
            (not (contains ?room ?thing))
            (owned ?thing ?person)))
    (:action escape
        :parameters (
            ?person - person
            ?exit - exit
            ?room - room)
        :precondition (and
            (contains ?room ?exit)
            (in ?person ?room))
        :effect (and
            (escaped ?person)))
    (:action move
        :parameters (
            ?moved_room - room
            ?place1 - place
            ?place2 - place
            ?direction - direction
            ?person - person
            ?dwelled_room - room
            ?terminal - terminal)
        :precondition (and
            (in ?person ?dwelled_room)
            (contains ?dwelled_room ?terminal)
            (free ?place2)
            (at ?moved_room ?place1)
            (adjacent ?place1 ?place2 ?direction))
        :effect (and
            (free ?place1)
            (not (free ?place2))
            (not (at ?moved_room ?place1))
            (at ?moved_room ?place2)))
)

; problem
(define (problem problem3-serialized)
    (:domain blocky-game)
        (:objects
            black - colour
            blue - colour
            green - colour
            red - colour
            white - colour
            yellow - colour
            entrance10_1 - entrance
            entrance11 - entrance
            entrance12 - entrance
            entrance13 - entrance
            entrance21 - entrance
            entrance22 - entrance
            entrance23 - entrance
            entrance31 - entrance
            entrance32 - entrance
            entrance41 - entrance
            entrance42 - entrance
            entrance51 - entrance
            entrance61 - entrance
            entrance62 - entrance
            entrance71 - entrance
            entrance72 - entrance
            entrance81 - entrance
            exit1 - exit
            exit2 - exit
            key_black1 - key
            key_black2 - key
            key_blue - key
            key_green - key
            key_red - key
            key_white1 - key
            key_white2 - key
            key_yellow - key
            person - person
            place11 - place
            place12 - place
            place13 - place
            place14 - place
            place15 - place
            place21 - place
            place22 - place
            place23 - place
            place24 - place
            place25 - place
            place31 - place
            place32 - place
            place33 - place
            place34 - place
            place35 - place
            place41 - place
            place42 - place
            place43 - place
            place44 - place
            place45 - place
            place51 - place
            place52 - place
            place53 - place
            place54 - place
            place55 - place
            room1 - room
            room10 - room
            room2 - room
            room3 - room
            room4 - room
            room5 - room
            room6 - room
            room7 - room
            room8 - room
            room9 - room
            terminal1 - terminal
            terminal2 - terminal)
        (:init
            (reversed right left)
            (reversed up down)
            (reversed down up)
            (reversed left right)

            (adjacent place11 place12 right)
            (adjacent place11 place21 down)
            (adjacent place12 place11 left)
            (adjacent place12 place13 right)
            (adjacent place12 place22 down)
            (adjacent place13 place12 left)
            (adjacent place13 place14 right)
            (adjacent place13 place23 down)
            (adjacent place14 place13 left)
            (adjacent place14 place15 right)
            (adjacent place14 place24 down)
            (adjacent place15 place14 left)
            (adjacent place15 place25 down)
            (adjacent place21 place11 up)
            (adjacent place21 place22 right)
            (adjacent place21 place31 down)
            (adjacent place22 place12 up)
            (adjacent place22 place21 left)
            (adjacent place22 place23 right)
            (adjacent place22 place32 down)
            (adjacent place23 place13 up)
            (adjacent place23 place22 left)
            (adjacent place23 place24 right)
            (adjacent place23 place33 down)
            (adjacent place24 place14 up)
            (adjacent place24 place23 left)
            (adjacent place24 place25 right)
            (adjacent place24 place34 down)
            (adjacent place25 place15 up)
            (adjacent place25 place24 left)
            (adjacent place25 place35 down)
            (adjacent place31 place21 up)
            (adjacent place31 place32 right)
            (adjacent place31 place41 down)
            (adjacent place32 place22 up)
            (adjacent place32 place31 left)
            (adjacent place32 place33 right)
            (adjacent place32 place42 down)
            (adjacent place33 place23 up)
            (adjacent place33 place32 left)
            (adjacent place33 place34 right)
            (adjacent place33 place43 down)
            (adjacent place34 place24 up)
            (adjacent place34 place33 left)
            (adjacent place34 place35 right)
            (adjacent place34 place44 down)
            (adjacent place35 place25 up)
            (adjacent place35 place34 left)
            (adjacent place35 place45 down)
            (adjacent place41 place31 up)
            (adjacent place41 place42 right)
            (adjacent place41 place51 down)
            (adjacent place42 place32 up)
            (adjacent place42 place41 left)
            (adjacent place42 place43 right)
            (adjacent place42 place52 down)
            (adjacent place43 place33 up)
            (adjacent place43 place42 left)
            (adjacent place43 place44 right)
            (adjacent place43 place53 down)
            (adjacent place44 place34 up)
            (adjacent place44 place43 left)
            (adjacent place44 place45 right)
            (adjacent place44 place54 down)
            (adjacent place45 place35 up)
            (adjacent place45 place44 left)
            (adjacent place45 place55 down)
            (adjacent place51 place41 up)
            (adjacent place51 place52 right)
            (adjacent place52 place42 up)
            (adjacent place52 place51 left)
            (adjacent place52 place53 right)
            (adjacent place53 place43 up)
            (adjacent place53 place52 left)
            (adjacent place53 place54 right)
            (adjacent place54 place44 up)
            (adjacent place54 place53 left)
            (adjacent place54 place55 right)
            (adjacent place55 place45 up)
            (adjacent place55 place54 left)
            (at room1 place51)
            (at room10 place14)
            (at room2 place52)
            (at room3 place42)
            (at room4 place32)
            (at room5 place41)
            (at room6 place15)
            (at room7 place43)
            (at room8 place54)
            (at room9 place53)
            (contains room1 key_green)
            (contains room10 key_white2)
            (contains room10 terminal2)
            (contains room2 terminal1)
            (contains room3 key_yellow)
            (contains room4 key_black2)
            (contains room4 key_white1)
            (contains room5 exit1)
            (contains room7 key_blue)
            (contains room8 key_black1)
            (contains room8 key_red)
            (contains room9 exit2)
            (free place11)
            (free place12)
            (free place13)
            (free place21)
            (free place22)
            (free place23)
            (free place24)
            (free place25)
            (free place31)
            (free place33)
            (free place34)
            (free place35)
            (free place44)
            (free place45)
            (free place55)
            (has_door entrance10_1 red)
            (has_door entrance11 green)
            (has_door entrance11 yellow)
            (has_door entrance12 green)
            (has_door entrance13 white)
            (has_door entrance22 green)
            (has_door entrance23 green)
            (has_door entrance31 green)
            (has_door entrance32 black)
            (has_door entrance41 white)
            (has_door entrance42 blue)
            (has_door entrance51 white)
            (has_door entrance61 white)
            (has_door entrance62 blue)
            (has_door entrance71 black)
            (has_door entrance72 red)
            (has_door entrance81 yellow)
            (in person room1)
            (is key_black1 black)
            (is key_black2 black)
            (is key_blue blue)
            (is key_green green)
            (is key_red red)
            (is key_white1 white)
            (is key_white2 white)
            (is key_yellow yellow)
            (passage room1 entrance11 up)
            (passage room1 entrance12 right)
            (passage room1 entrance13 down)
            (passage room10 entrance10_1 right)
            (passage room2 entrance21 right)
            (passage room2 entrance22 down)
            (passage room2 entrance23 left)
            (passage room3 entrance31 up)
            (passage room3 entrance32 down)
            (passage room4 entrance41 up)
            (passage room4 entrance42 right)
            (passage room5 entrance51 left)
            (passage room6 entrance61 right)
            (passage room6 entrance62 left)
            (passage room7 entrance71 up)
            (passage room7 entrance72 left)
            (passage room8 entrance81 down))
        (:goal
            (escaped person))
)

; plan
1. (take person key_green room1)
   deleted: (contains room1 key_green)
   added: (owned key_green person)
   goals met: 0 of 1
2. (go person room1 room2 place51 place52 entrance12 entrance23 right left green key_green)
   deleted: (in person room1)
   added: (in person room2)
   goals met: 0 of 1
3. (move room10 place14 place13 left person room2 terminal1)
   deleted: (free place13) (at room10 place14)
   added: (free place14) (at room10 place13)
   goals met: 0 of 1
4. (move room6 place15 place25 down person room2 terminal1)
   deleted: (free place25) (at room6 place15)
   added: (free place15) (at room6 place25)
   goals met: 0 of 1
5. (move room4 place32 place31 left person room2 terminal1)
   deleted: (free place31) (at room4 place32)
   added: (free place32) (at room4 place31)
   goals met: 0 of 1
6. (move room4 place31 place21 up person room2 terminal1)
   deleted: (free place21) (at room4 place31)
   added: (free place31) (at room4 place21)
   goals met: 0 of 1
7. (move room5 place41 place31 up person room2 terminal1)
   deleted: (free place31) (at room5 place41)
   added: (free place41) (at room5 place31)
   goals met: 0 of 1
8. (move room6 place25 place24 left person room2 terminal1)
   deleted: (free place24) (at room6 place25)
   added: (free place25) (at room6 place24)
   goals met: 0 of 1
9. (move room8 place54 place44 up person room2 terminal1)
   deleted: (free place44) (at room8 place54)
   added: (free place54) (at room8 place44)
   goals met: 0 of 1
10. (move room4 place21 place22 right person room2 terminal1)
   deleted: (free place22) (at room4 place21)
   added: (free place21) (at room4 place22)
   goals met: 0 of 1
11. (move room6 place24 place23 left person room2 terminal1)
   deleted: (free place23) (at room6 place24)
   added: (free place24) (at room6 place23)
   goals met: 0 of 1
12. (move room5 place31 place32 right person room2 terminal1)
   deleted: (free place32) (at room5 place31)
   added: (free place31) (at room5 place32)
   goals met: 0 of 1
13. (move room5 place32 place33 right person room2 terminal1)
   deleted: (free place33) (at room5 place32)
   added: (free place32) (at room5 place33)
   goals met: 0 of 1
14. (move room3 place42 place32 up person room2 terminal1)
   deleted: (free place32) (at room3 place42)
   added: (free place42) (at room3 place32)
   goals met: 0 of 1
15. (move room5 place33 place34 right person room2 terminal1)
   deleted: (free place34) (at room5 place33)
   added: (free place33) (at room5 place34)
   goals met: 0 of 1
16. (move room3 place32 place42 down person room2 terminal1)
   deleted: (free place42) (at room3 place32)
   added: (free place32) (at room3 place42)
   goals met: 0 of 1
17. (move room4 place22 place21 left person room2 terminal1)
   deleted: (free place21) (at room4 place22)
   added: (free place22) (at room4 place21)
   goals met: 0 of 1
18. (move room10 place13 place12 left person room2 terminal1)
   deleted: (free place12) (at room10 place13)
   added: (free place13) (at room10 place12)
   goals met: 0 of 1
19. (move room7 place43 place33 up person room2 terminal1)
   deleted: (free place33) (at room7 place43)
   added: (free place43) (at room7 place33)
   goals met: 0 of 1
20. (move room5 place34 place24 up person room2 terminal1)
   deleted: (free place24) (at room5 place34)
   added: (free place34) (at room5 place24)
   goals met: 0 of 1
21. (move room8 place44 place43 left person room2 terminal1)
   deleted: (free place43) (at room8 place44)
   added: (free place44) (at room8 place43)
   goals met: 0 of 1
22. (move room3 place42 place32 up person room2 terminal1)
   deleted: (free place32) (at room3 place42)
   added: (free place42) (at room3 place32)
   goals met: 0 of 1
23. (move room4 place21 place31 down person room2 terminal1)
   deleted: (free place31) (at room4 place21)
   added: (free place21) (at room4 place31)
   goals met: 0 of 1
24. (move room8 place43 place42 left person room2 terminal1)
   deleted: (free place42) (at room8 place43)
   added: (free place43) (at room8 place42)
   goals met: 0 of 1
25. (move room8 place42 place41 left person room2 terminal1)
   deleted: (free place41) (at room8 place42)
   added: (free place42) (at room8 place41)
   goals met: 0 of 1
26. (move room3 place32 place42 down person room2 terminal1)
   deleted: (free place42) (at room3 place32)
   added: (free place32) (at room3 place42)
   goals met: 0 of 1
27. (move room10 place12 place22 down person room2 terminal1)
   deleted: (free place22) (at room10 place12)
   added: (free place12) (at room10 place22)
   goals met: 0 of 1
28. (move room10 place22 place32 down person room2 terminal1)
   deleted: (free place32) (at room10 place22)
   added: (free place22) (at room10 place32)
   goals met: 0 of 1
29. (move room7 place33 place43 down person room2 terminal1)
   deleted: (free place43) (at room7 place33)
   added: (free place33) (at room7 place43)
   goals met: 0 of 1
30. (move room6 place23 place22 left person room2 terminal1)
   deleted: (free place22) (at room6 place23)
   added: (free place23) (at room6 place22)
   goals met: 0 of 1
31. (move room5 place24 place23 left person room2 terminal1)
   deleted: (free place23) (at room5 place24)
   added: (free place24) (at room5 place23)
   goals met: 0 of 1
32. (move room10 place32 place33 right person room2 terminal1)
   deleted: (free place33) (at room10 place32)
   added: (free place32) (at room10 place33)
   goals met: 0 of 1
33. (move room7 place43 place44 right person room2 terminal1)
   deleted: (free place44) (at room7 place43)
   added: (free place43) (at room7 place44)
   goals met: 0 of 1
34. (move room7 place44 place34 up person room2 terminal1)
   deleted: (free place34) (at room7 place44)
   added: (free place44) (at room7 place34)
   goals met: 0 of 1
35. (move room3 place42 place43 right person room2 terminal1)
   deleted: (free place43) (at room3 place42)
   added: (free place42) (at room3 place43)
   goals met: 0 of 1
36. (move room2 place52 place42 up person room2 terminal1)
   deleted: (free place42) (at room2 place52)
   added: (free place52) (at room2 place42)
   goals met: 0 of 1
37. (move room2 place42 place32 up person room2 terminal1)
   deleted: (free place32) (at room2 place42)
   added: (free place42) (at room2 place32)
   goals met: 0 of 1
38. (move room1 place51 place52 right person room2 terminal1)
   deleted: (free place52) (at room1 place51)
   added: (free place51) (at room1 place52)
   goals met: 0 of 1
39. (move room1 place52 place42 up person room2 terminal1)
   deleted: (free place42) (at room1 place52)
   added: (free place52) (at room1 place42)
   goals met: 0 of 1
40. (move room8 place41 place51 down person room2 terminal1)
   deleted: (free place51) (at room8 place41)
   added: (free place41) (at room8 place51)
   goals met: 0 of 1
41. (move room4 place31 place21 up person room2 terminal1)
   deleted: (free place21) (at room4 place31)
   added: (free place31) (at room4 place21)
   goals met: 0 of 1
42. (move room1 place42 place41 left person room2 terminal1)
   deleted: (free place41) (at room1 place42)
   added: (free place42) (at room1 place41)
   goals met: 0 of 1
43. (move room3 place43 place42 left person room2 terminal1)
   deleted: (free place42) (at room3 place43)
   added: (free place43) (at room3 place42)
   goals met: 0 of 1
44. (go person room2 room3 place32 place42 entrance22 entrance31 down up green key_green)
   deleted: (in person room2)
   added: (in person room3)
   goals met: 0 of 1
45. (take person key_yellow room3)
   deleted: (contains room3 key_yellow)
   added: (owned key_yellow person)
   goals met: 0 of 1
46. (go person room3 room2 place42 place32 entrance31 entrance22 up down green key_green)
   deleted: (in person room3)
   added: (in person room2)
   goals met: 0 of 1
47. (move room1 place41 place31 up person room2 terminal1)
   deleted: (free place31) (at room1 place41)
   added: (free place41) (at room1 place31)
   goals met: 0 of 1
48. (move room8 place51 place41 up person room2 terminal1)
   deleted: (free place41) (at room8 place51)
   added: (free place51) (at room8 place41)
   goals met: 0 of 1
49. (move room4 place21 place11 up person room2 terminal1)
   deleted: (free place11) (at room4 place21)
   added: (free place21) (at room4 place11)
   goals met: 0 of 1
50. (move room6 place22 place12 up person room2 terminal1)
   deleted: (free place12) (at room6 place22)
   added: (free place22) (at room6 place12)
   goals met: 0 of 1
51. (move room4 place11 place21 down person room2 terminal1)
   deleted: (free place21) (at room4 place11)
   added: (free place11) (at room4 place21)
   goals met: 0 of 1
52. (move room7 place34 place44 down person room2 terminal1)
   deleted: (free place44) (at room7 place34)
   added: (free place34) (at room7 place44)
   goals met: 0 of 1
53. (move room10 place33 place34 right person room2 terminal1)
   deleted: (free place34) (at room10 place33)
   added: (free place33) (at room10 place34)
   goals met: 0 of 1
54. (move room7 place44 place45 right person room2 terminal1)
   deleted: (free place45) (at room7 place44)
   added: (free place44) (at room7 place45)
   goals met: 0 of 1
55. (move room3 place42 place43 right person room2 terminal1)
   deleted: (free place43) (at room3 place42)
   added: (free place42) (at room3 place43)
   goals met: 0 of 1
56. (move room7 place45 place55 down person room2 terminal1)
   deleted: (free place55) (at room7 place45)
   added: (free place45) (at room7 place55)
   goals met: 0 of 1
57. (move room7 place55 place54 left person room2 terminal1)
   deleted: (free place54) (at room7 place55)
   added: (free place55) (at room7 place54)
   goals met: 0 of 1
58. (move room5 place23 place13 up person room2 terminal1)
   deleted: (free place13) (at room5 place23)
   added: (free place23) (at room5 place13)
   goals met: 0 of 1
59. (move room4 place21 place11 up person room2 terminal1)
   deleted: (free place11) (at room4 place21)
   added: (free place21) (at room4 place11)
   goals met: 0 of 1
60. (move room8 place41 place42 right person room2 terminal1)
   deleted: (free place42) (at room8 place41)
   added: (free place41) (at room8 place42)
   goals met: 0 of 1
61. (move room2 place32 place33 right person room2 terminal1)
   deleted: (free place33) (at room2 place32)
   added: (free place32) (at room2 place33)
   goals met: 0 of 1
62. (move room8 place42 place32 up person room2 terminal1)
   deleted: (free place32) (at room8 place42)
   added: (free place42) (at room8 place32)
   goals met: 0 of 1
63. (move room8 place32 place22 up person room2 terminal1)
   deleted: (free place22) (at room8 place32)
   added: (free place32) (at room8 place22)
   goals met: 0 of 1
64. (move room4 place11 place21 down person room2 terminal1)
   deleted: (free place21) (at room4 place11)
   added: (free place11) (at room4 place21)
   goals met: 0 of 1
65. (move room1 place31 place32 right person room2 terminal1)
   deleted: (free place32) (at room1 place31)
   added: (free place31) (at room1 place32)
   goals met: 0 of 1
66. (go person room2 room1 place33 place32 entrance23 entrance12 left right green key_green)
   deleted: (in person room2)
   added: (in person room1)
   goals met: 0 of 1
67. (go person room1 room8 place32 place22 entrance11 entrance81 up down yellow key_yellow)
   deleted: (in person room1)
   added: (in person room8)
   goals met: 0 of 1
68. (take person key_black1 room8)
   deleted: (contains room8 key_black1)
   added: (owned key_black1 person)
   goals met: 0 of 1
69. (take person key_red room8)
   deleted: (contains room8 key_red)
   added: (owned key_red person)
   goals met: 0 of 1
70. (go person room8 room1 place22 place32 entrance81 entrance11 down up yellow key_yellow)
   deleted: (in person room8)
   added: (in person room1)
   goals met: 0 of 1
71. (go person room1 room2 place32 place33 entrance12 entrance23 right left green key_green)
   deleted: (in person room1)
   added: (in person room2)
   goals met: 0 of 1
72. (move room4 place21 place11 up person room2 terminal1)
   deleted: (free place11) (at room4 place21)
   added: (free place21) (at room4 place11)
   goals met: 0 of 1
73. (move room10 place34 place44 down person room2 terminal1)
   deleted: (free place44) (at room10 place34)
   added: (free place34) (at room10 place44)
   goals met: 0 of 1
74. (move room9 place53 place52 left person room2 terminal1)
   deleted: (free place52) (at room9 place53)
   added: (free place53) (at room9 place52)
   goals met: 0 of 1
75. (move room7 place54 place53 left person room2 terminal1)
   deleted: (free place53) (at room7 place54)
   added: (free place54) (at room7 place53)
   goals met: 0 of 1
76. (move room4 place11 place21 down person room2 terminal1)
   deleted: (free place21) (at room4 place11)
   added: (free place11) (at room4 place21)
   goals met: 0 of 1
77. (move room4 place21 place31 down person room2 terminal1)
   deleted: (free place31) (at room4 place21)
   added: (free place21) (at room4 place31)
   goals met: 0 of 1
78. (move room4 place31 place41 down person room2 terminal1)
   deleted: (free place41) (at room4 place31)
   added: (free place31) (at room4 place41)
   goals met: 0 of 1
79. (go person room2 room3 place33 place43 entrance22 entrance31 down up green key_green)
   deleted: (in person room2)
   added: (in person room3)
   goals met: 0 of 1
80. (go person room3 room7 place43 place53 entrance32 entrance71 down up black key_black1)
   deleted: (in person room3)
   added: (in person room7)
   goals met: 0 of 1
81. (take person key_blue room7)
   deleted: (contains room7 key_blue)
   added: (owned key_blue person)
   goals met: 0 of 1
82. (go person room7 room3 place53 place43 entrance71 entrance32 up down black key_black1)
   deleted: (in person room7)
   added: (in person room3)
   goals met: 0 of 1
83. (go person room3 room2 place43 place33 entrance31 entrance22 up down green key_green)
   deleted: (in person room3)
   added: (in person room2)
   goals met: 0 of 1
84. (move room1 place32 place31 left person room2 terminal1)
   deleted: (free place31) (at room1 place32)
   added: (free place32) (at room1 place31)
   goals met: 0 of 1
85. (move room2 place33 place32 left person room2 terminal1)
   deleted: (free place32) (at room2 place33)
   added: (free place33) (at room2 place32)
   goals met: 0 of 1
86. (move room3 place43 place42 left person room2 terminal1)
   deleted: (free place42) (at room3 place43)
   added: (free place43) (at room3 place42)
   goals met: 0 of 1
87. (move room1 place31 place21 up person room2 terminal1)
   deleted: (free place21) (at room1 place31)
   added: (free place31) (at room1 place21)
   goals met: 0 of 1
88. (move room4 place41 place31 up person room2 terminal1)
   deleted: (free place31) (at room4 place41)
   added: (free place41) (at room4 place31)
   goals met: 0 of 1
89. (move room8 place22 place23 right person room2 terminal1)
   deleted: (free place23) (at room8 place22)
   added: (free place22) (at room8 place23)
   goals met: 0 of 1
90. (move room2 place32 place22 up person room2 terminal1)
   deleted: (free place22) (at room2 place32)
   added: (free place32) (at room2 place22)
   goals met: 0 of 1
91. (move room3 place42 place32 up person room2 terminal1)
   deleted: (free place32) (at room3 place42)
   added: (free place42) (at room3 place32)
   goals met: 0 of 1
92. (move room7 place53 place43 up person room2 terminal1)
   deleted: (free place43) (at room7 place53)
   added: (free place53) (at room7 place43)
   goals met: 0 of 1
93. (move room7 place43 place33 up person room2 terminal1)
   deleted: (free place33) (at room7 place43)
   added: (free place43) (at room7 place33)
   goals met: 0 of 1
94. (move room7 place33 place34 right person room2 terminal1)
   deleted: (free place34) (at room7 place33)
   added: (free place33) (at room7 place34)
   goals met: 0 of 1
95. (move room10 place44 place43 left person room2 terminal1)
   deleted: (free place43) (at room10 place44)
   added: (free place44) (at room10 place43)
   goals met: 0 of 1
96. (move room1 place21 place11 up person room2 terminal1)
   deleted: (free place11) (at room1 place21)
   added: (free place21) (at room1 place11)
   goals met: 0 of 1
97. (move room8 place23 place24 right person room2 terminal1)
   deleted: (free place24) (at room8 place23)
   added: (free place23) (at room8 place24)
   goals met: 0 of 1
98. (move room1 place11 place21 down person room2 terminal1)
   deleted: (free place21) (at room1 place11)
   added: (free place11) (at room1 place21)
   goals met: 0 of 1
99. (move room3 place32 place33 right person room2 terminal1)
   deleted: (free place33) (at room3 place32)
   added: (free place32) (at room3 place33)
   goals met: 0 of 1
100. (move room7 place34 place44 down person room2 terminal1)
   deleted: (free place44) (at room7 place34)
   added: (free place34) (at room7 place44)
   goals met: 0 of 1
101. (move room2 place22 place23 right person room2 terminal1)
   deleted: (free place23) (at room2 place22)
   added: (free place22) (at room2 place23)
   goals met: 0 of 1
102. (move room6 place12 place22 down person room2 terminal1)
   deleted: (free place22) (at room6 place12)
   added: (free place12) (at room6 place22)
   goals met: 0 of 1
103. (move room6 place22 place32 down person room2 terminal1)
   deleted: (free place32) (at room6 place22)
   added: (free place22) (at room6 place32)
   goals met: 0 of 1
104. (move room1 place21 place22 right person room2 terminal1)
   deleted: (free place22) (at room1 place21)
   added: (free place21) (at room1 place22)
   goals met: 0 of 1
105. (move room1 place22 place12 up person room2 terminal1)
   deleted: (free place12) (at room1 place22)
   added: (free place22) (at room1 place12)
   goals met: 0 of 1
106. (move room6 place32 place22 up person room2 terminal1)
   deleted: (free place22) (at room6 place32)
   added: (free place32) (at room6 place22)
   goals met: 0 of 1
107. (move room5 place13 place14 right person room2 terminal1)
   deleted: (free place14) (at room5 place13)
   added: (free place13) (at room5 place14)
   goals met: 0 of 1
108. (move room4 place31 place21 up person room2 terminal1)
   deleted: (free place21) (at room4 place31)
   added: (free place31) (at room4 place21)
   goals met: 0 of 1
109. (move room2 place23 place13 up person room2 terminal1)
   deleted: (free place13) (at room2 place23)
   added: (free place23) (at room2 place13)
   goals met: 0 of 1
110. (move room6 place22 place23 right person room2 terminal1)
   deleted: (free place23) (at room6 place22)
   added: (free place22) (at room6 place23)
   goals met: 0 of 1
111. (move room8 place24 place34 down person room2 terminal1)
   deleted: (free place34) (at room8 place24)
   added: (free place24) (at room8 place34)
   goals met: 0 of 1
112. (move room10 place43 place42 left person room2 terminal1)
   deleted: (free place42) (at room10 place43)
   added: (free place43) (at room10 place42)
   goals met: 0 of 1
113. (move room5 place14 place24 down person room2 terminal1)
   deleted: (free place24) (at room5 place14)
   added: (free place14) (at room5 place24)
   goals met: 0 of 1
114. (move room7 place44 place43 left person room2 terminal1)
   deleted: (free place43) (at room7 place44)
   added: (free place44) (at room7 place43)
   goals met: 0 of 1
115. (move room6 place23 place22 left person room2 terminal1)
   deleted: (free place22) (at room6 place23)
   added: (free place23) (at room6 place22)
   goals met: 0 of 1
116. (move room2 place13 place23 down person room2 terminal1)
   deleted: (free place23) (at room2 place13)
   added: (free place13) (at room2 place23)
   goals met: 0 of 1
117. (go person room2 room3 place23 place33 entrance22 entrance31 down up green key_green)
   deleted: (in person room2)
   added: (in person room3)
   goals met: 0 of 1
118. (go person room3 room7 place33 place43 entrance32 entrance71 down up black key_black1)
   deleted: (in person room3)
   added: (in person room7)
   goals met: 0 of 1
119. (go person room7 room10 place43 place42 entrance72 entrance10_1 left right red key_red)
   deleted: (in person room7)
   added: (in person room10)
   goals met: 0 of 1
120. (take person key_white2 room10)
   deleted: (contains room10 key_white2)
   added: (owned key_white2 person)
   goals met: 0 of 1
121. (go person room10 room7 place42 place43 entrance10_1 entrance72 right left red key_red)
   deleted: (in person room10)
   added: (in person room7)
   goals met: 0 of 1
122. (go person room7 room3 place43 place33 entrance71 entrance32 up down black key_black1)
   deleted: (in person room7)
   added: (in person room3)
   goals met: 0 of 1
123. (go person room3 room2 place33 place23 entrance31 entrance22 up down green key_green)
   deleted: (in person room3)
   added: (in person room2)
   goals met: 0 of 1
124. (move room2 place23 place13 up person room2 terminal1)
   deleted: (free place13) (at room2 place23)
   added: (free place23) (at room2 place13)
   goals met: 0 of 1
125. (move room5 place24 place23 left person room2 terminal1)
   deleted: (free place23) (at room5 place24)
   added: (free place24) (at room5 place23)
   goals met: 0 of 1
126. (move room1 place12 place11 left person room2 terminal1)
   deleted: (free place11) (at room1 place12)
   added: (free place12) (at room1 place11)
   goals met: 0 of 1
127. (move room2 place13 place12 left person room2 terminal1)
   deleted: (free place12) (at room2 place13)
   added: (free place13) (at room2 place12)
   goals met: 0 of 1
128. (go person room2 room1 place12 place11 entrance23 entrance12 left right green key_green)
   deleted: (in person room2)
   added: (in person room1)
   goals met: 0 of 1
129. (go person room1 room4 place11 place21 entrance13 entrance41 down up white key_white2)
   deleted: (in person room1)
   added: (in person room4)
   goals met: 0 of 1
130. (go person room4 room6 place21 place22 entrance42 entrance62 right left blue key_blue)
   deleted: (in person room4)
   added: (in person room6)
   goals met: 0 of 1
131. (go person room6 room5 place22 place23 entrance61 entrance51 right left white key_white2)
   deleted: (in person room6)
   added: (in person room5)
   goals met: 0 of 1
132. (escape person exit1 room5)
   added: (escaped person)
   goals met: 1 of 1
